#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.wallet will be created
  + resource "azurerm_resource_group" "wallet" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "io-p-itn-wallet-rg-01"
      + tags     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
    }

  # module.key_vaults.azurerm_key_vault.wallet will be created
  + resource "azurerm_key_vault" "wallet" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "io-p-itn-wallet-kv-01"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "io-p-itn-wallet-rg-01"
      + sku_name                      = "premium"
      + soft_delete_retention_days    = 90
      + tags                          = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Wallet"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
      + tenant_id                     = "7788edaf-0346-4068-9d79-c868aed15b3d"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.key_vaults.azurerm_management_lock.this will be created
  + resource "azurerm_management_lock" "this" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "io-p-itn-wallet-kv-01-lock"
      + notes      = "this items can't be deleted in this subscription!"
      + scope      = (known after apply)
    }

  # module.networking.azurerm_subnet.wallet_func will be created
  + resource "azurerm_subnet" "wallet_func" {
      + address_prefixes                               = [
          + "10.20.253.0/26",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-wallet-func-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-p-itn-common-rg-01"
      + virtual_network_name                           = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
